# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [8]:
import numpy as np
import pandas as pd

In [10]:
from numpy.random import randn
np.random.seed(1)

In [12]:
df = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [18]:
df['W']

A    1.624345
B    0.865408
C    0.319039
D   -0.322417
E   -0.172428
Name: W, dtype: float64

In [24]:
# Pass a list of column names
newdf = df[['W','Z']]

In [26]:
newdf

          W         Z
A  1.624345 -1.072969
B  0.865408 -0.761207
C  0.319039 -2.060141
D -0.322417 -1.099891
E -0.172428  0.582815

DataFrame Columns are just Series

**Creating a new column:**

In [42]:
df['Q']=[1,2,3,4,5]

In [44]:
df

          W         X         Y         Z  Q
A  1.624345 -0.611756 -0.528172 -1.072969  1
B  0.865408 -2.301539  1.744812 -0.761207  2
C  0.319039 -0.249370  1.462108 -2.060141  3
D -0.322417 -0.384054  1.133769 -1.099891  4
E -0.172428 -0.877858  0.042214  0.582815  5

** Removing Columns**

In [47]:
df.drop('Q',axis=1)

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [49]:
# Not inplace unless specified!
df.drop('Q',axis=1,inplace=True)

In [51]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

Can also drop rows this way:

In [53]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891

In [55]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

** Selecting Rows**

In [57]:
df.loc['A']

W    1.624345
X   -0.611756
Y   -0.528172
Z   -1.072969
Name: A, dtype: float64

Or select based off of position instead of label

In [59]:
df.iloc[0]

W    1.624345
X   -0.611756
Y   -0.528172
Z   -1.072969
Name: A, dtype: float64

In [61]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

** Selecting subset of rows and columns **

In [67]:
df.loc['B','Y']

1.74481176421648

In [63]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.624345 -0.528172
B  0.865408  1.744812

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [69]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [71]:
df[df['Y']>0]

          W         X         Y         Z
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [73]:
df >0

       W      X      Y      Z
A   True  False  False  False
B   True  False   True  False
C   True  False   True  False
D  False  False   True  False
E  False  False   True   True

In [75]:
df[df >0]

          W   X         Y         Z
A  1.624345 NaN       NaN       NaN
B  0.865408 NaN  1.744812       NaN
C  0.319039 NaN  1.462108       NaN
D       NaN NaN  1.133769       NaN
E       NaN NaN  0.042214  0.582815

In [79]:
df[(df['W']>0 )& (df['Z']<0)]

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141

A   -0.528172
B    1.744812
C    1.462108
Name: Y, dtype: float64

          Y         X
A -0.528172 -0.611756
B  1.744812 -2.301539
C  1.462108 -0.249370

In [55]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

For two conditions you can use | and & with parenthesis:

          W         X         Y         Z
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [209]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z States
A  1.624345 -0.611756 -0.528172 -1.072969     CA
B  0.865408 -2.301539  1.744812 -0.761207     NY
C  0.319039 -0.249370  1.462108 -2.060141     WY
D -0.322417 -0.384054  1.133769 -1.099891     OR
E -0.172428 -0.877858  0.042214  0.582815     CO

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [215]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [216]:
#but the index as states are not applied for applying what you do ...

In [218]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Great Job!